# -*- coding: utf-8 -*-
"""
База известных предметов для распознавания.
Формат:
    'Каноническое название': ['ключевое_слово1', 'ключевое_слово2']
"""

ITEMS_DB = {
    'Голубая щука': ['щука', 'голубая'],
    'Пятнистая форель': ['форель', 'пятнистая', 'форел'],
    'Яркоперый судак': ['судак', 'яркоперый', 'коперый'],
    'Речной угорь': ['угорь', 'речной'],
    'Синеглазка': ['синеглазка'],
    'Мелководный краб': ['краб', 'мелководный'],
    'Пестроногий подкаменщик': ['подкаменщик', 'пестроногий'],
    'Камышовый подкаменщик': ['подкаменщик', 'камышовый', 'подкаменщи', 'амышовый'],
    'обычные бревна': ['бревна', 'обычные'],
    'Грубый камень': ['камень', 'грубый'],
    'Книга интуиции': ['книга', 'интуиция'],
    'Горная слепоглазка': ['слепоглазка', 'горная'],
    'Красноводный угорь': ['угорь', 'красноводный'],
    'Альбионский окунь': ['льбионский', 'альбионский', 'окунь'],
    'Мглистый окунь': ['глистый', 'окунь','мглистый'],
    'Дымчатый окунь': ['ымчатый' ,'окунь', 'дымчатый']
}