# Результаты распознавания текста со скриншотов
data = {
    "screenshot_2025-04-04_20-25-09.png": """Мелководный краб

Получено 1 шт.""",
    "screenshot_2025-04-04_20-25-46.png": """Синеглазка

Получено 2 шт.""",
    "screenshot_2025-04-05_09-58-24.png": """Речной угорь

Получено 2 шт.""",
    "screenshot_2025-04-05_09-58-50.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_09-59-12.png": """стер рыбной ловли""",
    "screenshot_2025-04-05_09-59-41.png": """Синеглазка

Получено 1 шт.""",
    "screenshot_2025-04-05_10-00-38.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-01-16.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-01-55.png": """Пятнистая форель

Получено 2 шт.""",
    "screenshot_2025-04-05_10-02-34.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-02-55.png": """Голубая щука

Получено 2 шт.""",
    "screenshot_2025-04-05_10-03-30.png": """обычные бревна

Получено 1 шт.""",
    "screenshot_2025-04-05_10-03-55.png": """Пятнистая форель

Получено 1 шт.""",
    "screenshot_2025-04-05_10-04-23.png": """Голубая щука

Получено 1 шт.""",
    "screenshot_2025-04-05_10-05-07.png": """обычные бревна

Получено 1 шт.""",
    "screenshot_2025-04-05_10-05-35.png": """Пестроногий подкаменщик
Получено 1 шт.""",
    "screenshot_2025-04-05_10-06-24.png": """Грубый камень

Получено 2 шт.""",
    "screenshot_2025-04-05_10-07-14.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-08-02.png": """Грубый камень

Получено 2 шт.""",
    "screenshot_2025-04-05_10-08-43.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-09-24.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-10-26.png": """обычные бревна

Получено 1 шт.""",
    "screenshot_2025-04-05_10-10-57.png": """обычные бревна

Получено 1 шт.""",
    "screenshot_2025-04-05_10-11-33.png": """Грубый камень

Получено 2 шт.""",
    "screenshot_2025-04-05_10-12-23.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-13-09.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-13-35.png": """Яркоперый судак

Получено 2 шт.""",
    "screenshot_2025-04-05_10-14-09.png": """Синеглазка

Получено 2 шт.""",
    "screenshot_2025-04-05_10-14-49.png": """Грубый камень

Получено 2 шт.""",
    "screenshot_2025-04-05_10-15-31.png": """Грубый камень

Получено 2 шт.""",
    "screenshot_2025-04-05_10-15-55.png": """Яркоперый судак

Получено 2 шт.""",
    "screenshot_2025-04-05_10-16-22.png": """Яркоперый судак

Получено 1 шт.""",
    "screenshot_2025-04-05_10-17-03.png": """Грубый камень

Получено 2 шт.""",
    "screenshot_2025-04-05_10-17-45.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-18-14.png": """Пятнистая форель

Получено 1 шт.""",
    "screenshot_2025-04-05_10-18-41.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-19-39.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-20-16.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-20-52.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-21-30.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-21-55.png": """у обычные бревна

Получено 1 шт.""",
    "screenshot_2025-04-05_10-22-29.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-22-53.png": """) обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-23-17.png": """Яркоперый судак

Получено 1 шт. З.""",
    "screenshot_2025-04-05_10-24-16.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-24-40.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-25-12.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-25-52.png": """Пятнистая форель

Получено 2 шт.""",
    "screenshot_2025-04-05_10-26-41.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-27-14.png": """обычные бревна

Получено 1 шт.""",
    "screenshot_2025-04-05_10-27-52.png": """коперый судак
Получено 1 шт.""",
    "screenshot_2025-04-05_10-29-45.png": """бу голубая щука
Получено 1 шт.""",
    "screenshot_2025-04-05_10-30-24.png": """ычные бревна
Получено 1 шт.""",
    "screenshot_2025-04-05_10-30-45.png": """№ Голубая щука
Получено 2 шт.""",
    "screenshot_2025-04-05_10-31-36.png": """ПР Яркоперый судак
Получено 1 шт.""",
    "screenshot_2025-04-05_10-31-55.png": """№ голубая щука
Получено 1 шт.""",
    "screenshot_2025-04-05_10-32-16.png": """бу голубая щука
Получено 1 шт.""",
    "screenshot_2025-04-05_10-32-44.png": """у текоперый судак
Получено 1 шт.""",
    "screenshot_2025-04-05_10-33-21.png": """К яркоперый судак
Получено 2 шт.""",
    "screenshot_2025-04-05_10-33-49.png": """ПР яркоперый судак
Получено 1 шт.""",
    "screenshot_2025-04-05_10-35-06.png": """ПИРяокоперый судак
Получено 1 шт.""",
    "screenshot_2025-04-05_10-39-02.png": """— обычные бревна |.

Получено 1 шт.""",
    "screenshot_2025-04-05_10-39-33.png": """| Речной угорь |.

Получено 2 шт.""",
    "screenshot_2025-04-05_10-39-55.png": """1 Голубая щука о

Получено 1 шт.""",
    "screenshot_2025-04-05_10-40-19.png": """амышовый подкаменщи
Пол;""",
    "screenshot_2025-04-05_10-40-43.png": """| обычные бревна ‚о

Получено 2 шт.""",
    "screenshot_2025-04-05_10-41-11.png": """| обычные бревна в

Получено 1 шт.""",
    "screenshot_2025-04-05_10-41-41.png": """Ш Синеглазка
Получено 2 шт.""",
    "screenshot_2025-04-05_10-41-58.png": """| Голубая щука
Получено 2 шт.""",
    "screenshot_2025-04-05_10-42-23.png": """_ @ коперый судак
` Получено 1 шт.""",
    "screenshot_2025-04-05_10-42-49.png": """Пятнистая форель
Получено 2 шт.""",
    "screenshot_2025-04-05_10-43-16.png": """ятнистая форель
Получено 2 шт.""",
    "screenshot_2025-04-05_10-43-35.png": """Голубая щука
` Получено 1 шт.""",
    "screenshot_2025-04-05_10-44-02.png": """К яокоперый судак `

Получено 2 шт.""",
    "screenshot_2025-04-05_10-45-26.png": """| обычные бревна о

Получено 1 шт.""",
    "screenshot_2025-04-05_10-45-48.png": """1 Голубая щука о

Получено 2 шт.""",
    "screenshot_2025-04-05_10-46-14.png": """1 обычные бревна о

Получено 2 шт.""",
    "screenshot_2025-04-05_10-46-38.png": """| обычные бревна \

Получено 1 шт.""",
    "screenshot_2025-04-05_10-47-09.png": """_] Яркоперый судак
Получено 1 шт.""",
    "screenshot_2025-04-05_10-47-40.png": """и Голубая щука ‚о

Получено 2 шт.""",
    "screenshot_2025-04-05_10-48-01.png": """и Голубая щука ``

Получено 2 шт.""",
    "screenshot_2025-04-05_10-48-34.png": """р Синеглазка
Получено 1 шт.""",
    "screenshot_2025-04-05_10-48-58.png": """Голубая щука

Получено 2 шт.""",
    "screenshot_2025-04-05_10-49-23.png": """Пятнистая форель

Получено 2 шт.""",
    "screenshot_2025-04-05_10-50-11.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-50-58.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-51-52.png": """Голубая щука

Получено 2 шт.""",
    "screenshot_2025-04-05_10-52-21.png": """Яркоперый судак

Получено 2 шт.""",
    "screenshot_2025-04-05_10-53-09.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-53-29.png": """Голубая щука

Получено 1 шт.""",
    "screenshot_2025-04-05_10-54-03.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-57-43.png": """Пятнистая форель

Получено 2 шт.""",
    "screenshot_2025-04-05_10-58-32.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_10-58-58.png": """Пятнистая форель

Получено 2 шт.""",
    "screenshot_2025-04-05_10-59-33.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_11-00-06.png": """обычные бревна

Получено 1 шт.""",
    "screenshot_2025-04-05_11-00-24.png": """Книга интуиции (знаток)""",
    "screenshot_2025-04-05_11-00-47.png": """обычные бревна

Получено 1 шт.""",
    "screenshot_2025-04-05_11-01-14.png": """Пестроногий подкаменщик
Получено 2 шт.""",
    "screenshot_2025-04-05_11-01-42.png": """Камышовый подкаменщик
Получено 2 шт.""",
    "screenshot_2025-04-05_11-02-21.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_11-03-00.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_11-03-35.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_11-03-56.png": """Яркоперый судак

Получено 2 шт.""",
    "screenshot_2025-04-05_11-04-16.png": """Голубая щука

Получено 2 шт.""",
    "screenshot_2025-04-05_11-04-42.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_11-05-06.png": """Пятнистая форель

Получено 1 шт.""",
    "screenshot_2025-04-05_11-05-31.png": """Грубый камень

Получено 2 шт.""",
    "screenshot_2025-04-05_11-06-02.png": """обычные бревна

Получено 2 шт.""",
    "screenshot_2025-04-05_11-06-26.png": """Синеглазка

Получено 2 шт.""",
    "screenshot_2025-04-05_11-06-59.png": """обычные бревна

Получено 1 шт.""",
}
